; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-95)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 - object)
 (:init 
    (arm-empty)
    (clear b28)
    (on b28 b2)
    (on b2 b22)
    (on b22 b13)
    (on b13 b1)
    (on b1 b14)
    (on b14 b11)
    (on b11 b5)
    (on b5 b26)
    (on-table b26)
    (clear b24)
    (on b24 b16)
    (on b16 b27)
    (on b27 b9)
    (on b9 b18)
    (on b18 b23)
    (on b23 b21)
    (on b21 b25)
    (on b25 b4)
    (on b4 b6)
    (on b6 b19)
    (on b19 b15)
    (on-table b15)
    (clear b8)
    (on-table b8)
    (clear b12)
    (on b12 b3)
    (on b3 b10)
    (on b10 b20)
    (on b20 b7)
    (on b7 b17)
    (on-table b17))
 (:goal (and 
(on-table b17)
(on b9 b10)
))
)

; plan
1. (unstack b24 b16)
   deleted: (on b24 b16) (clear b24) (arm-empty)
   added: (holding b24) (clear b16)
   goals met: 1 of 2
2. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 1 of 2
3. (unstack b16 b27)
   deleted: (on b16 b27) (clear b16) (arm-empty)
   added: (holding b16) (clear b27)
   goals met: 1 of 2
4. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 2
5. (unstack b12 b3)
   deleted: (on b12 b3) (clear b12) (arm-empty)
   added: (holding b12) (clear b3)
   goals met: 1 of 2
6. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 1 of 2
7. (unstack b27 b9)
   deleted: (on b27 b9) (clear b27) (arm-empty)
   added: (holding b27) (clear b9)
   goals met: 1 of 2
8. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 1 of 2
9. (unstack b3 b10)
   deleted: (on b3 b10) (clear b3) (arm-empty)
   added: (holding b3) (clear b10)
   goals met: 1 of 2
10. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 2
11. (unstack b9 b18)
   deleted: (on b9 b18) (clear b9) (arm-empty)
   added: (holding b9) (clear b18)
   goals met: 1 of 2
12. (stack b9 b10)
   deleted: (clear b10) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b10)
   goals met: 2 of 2
